---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ValueAtPoint..::..SetFlags Method
ValueAtPoint Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SetFlags(IList<(Of <<'(Int32>)>>)) | Independently sets the flags associated to all measurements.  (Inherited from ValueAtPointBase.) |
|  | SetFlags(Int32) | Sets the flags associated to all measurements to the same value.  (Inherited from ValueAtPointBase.) |
|  | SetFlags(Int32, Int32) | Sets the flags associated to a given measurement.  (Inherited from ValueAtPointBase.) |

# See Also

ValueAtPoint Class

ValueAtPoint Members

Autodesk.Revit.DB.Analysis Namespace